PinguinoIDE/pinguino-compilers/linux/p8/share/gputils/header/p18f27j13.inc
        LIST

;==========================================================================
;  MPASM PIC18F27J13 processor include
; 
;  (c) Copyright 1999-2013 Microchip Technology, All rights reserved
;==========================================================================

        NOLIST

;==========================================================================
;  This header file defines configurations, registers, and other useful
;  bits of information for the PIC18F27J13 microcontroller.  These names
;  are taken to match the data sheets as closely as possible.
;
;  Note that the processor must be selected before this file is included.
;  The processor may be selected the following ways:
;
;       1. Command line switch:
;               C:\MPASM MYFILE.ASM /PIC18F27J13
;       2. LIST directive in the source file
;               LIST   P=PIC18F27J13
;       3. Processor Type entry in the MPASM full-screen interface
;       4. Setting the processor in the MPLAB Project Dialog
;==========================================================================

;==========================================================================
;
;       Verify Processor
;
;==========================================================================
        IFNDEF __18F27J13
           MESSG "Processor-header file mismatch.  Verify selected processor."
        ENDIF

;==========================================================================
;       18xxxx Family        EQUates
;==========================================================================
FSR0            EQU 0
FSR1            EQU 1
FSR2            EQU 2

FAST            EQU 1

W               EQU 0
A               EQU 0
ACCESS          EQU 0
BANKED          EQU 1
;==========================================================================

;==========================================================================
;       16Cxxx/17Cxxx Substitutions
;==========================================================================
  #define DDRA  TRISA      ; PIC17Cxxx SFR substitution
  #define DDRB  TRISB      ; PIC17Cxxx SFR substitution
  #define DDRC  TRISC      ; PIC17Cxxx SFR substitution
  #define DDRD  TRISD      ; PIC17Cxxx SFR substitution
  #define DDRE  TRISE      ; PIC17Cxxx SFR substitution

;==========================================================================
;
;       Register Definitions
;
;==========================================================================

;----- Register Files -----------------------------------------------------
ADCTRIG          EQU  H'0EB8'
PD0              EQU  H'0EB9'
PMDIS0           EQU  H'0EB9'
PD1              EQU  H'0EBA'
PMDIS1           EQU  H'0EBA'
PD2              EQU  H'0EBB'
PMDIS2           EQU  H'0EBB'
PD3              EQU  H'0EBC'
PMDIS3           EQU  H'0EBC'
PPSCON           EQU  H'0EBF'
RPOR0            EQU  H'0EC0'
RPOR1            EQU  H'0EC1'
RPOR2            EQU  H'0EC2'
RPOR3            EQU  H'0EC3'
RPOR4            EQU  H'0EC4'
RPOR5            EQU  H'0EC5'
RPOR6            EQU  H'0EC6'
RPOR7            EQU  H'0EC7'
RPOR8            EQU  H'0EC8'
RPOR9            EQU  H'0EC9'
RPOR10           EQU  H'0ECA'
RPOR11           EQU  H'0ECB'
RPOR12           EQU  H'0ECC'
RPOR13           EQU  H'0ECD'
RPOR14           EQU  H'0ECE'
RPOR15           EQU  H'0ECF'
RPOR16           EQU  H'0ED0'
RPOR17           EQU  H'0ED1'
RPOR18           EQU  H'0ED2'
RPINR1           EQU  H'0EE1'
RPINR2           EQU  H'0EE2'
RPINR3           EQU  H'0EE3'
RPINR4           EQU  H'0EE4'
RPINR6           EQU  H'0EE6'
RPINR15          EQU  H'0EE7'
RPINR7           EQU  H'0EE8'
RPINR8           EQU  H'0EE9'
RPINR9           EQU  H'0EEA'
RPINR12          EQU  H'0EF2'
RPINR13          EQU  H'0EF3'
RPINR14          EQU  H'0EF4'
RPINR16          EQU  H'0EF7'
RPINR17          EQU  H'0EF8'
RPINR21          EQU  H'0EFC'
RPINR22          EQU  H'0EFD'
RPINR23          EQU  H'0EFE'
RPINR24          EQU  H'0EFF'
CCP10CON         EQU  H'0F00'
CCPR10L          EQU  H'0F01'
CCPR10H          EQU  H'0F02'
CCP9CON          EQU  H'0F03'
CCPR9L           EQU  H'0F04'
CCPR9H           EQU  H'0F05'
CCP8CON          EQU  H'0F06'
CCPR8L           EQU  H'0F07'
CCPR8H           EQU  H'0F08'
CCP7CON          EQU  H'0F09'
CCPR7L           EQU  H'0F0A'
CCPR7H           EQU  H'0F0B'
CCP6CON          EQU  H'0F0C'
CCPR6L           EQU  H'0F0D'
CCPR6H           EQU  H'0F0E'
CCP5CON          EQU  H'0F0F'
CCPR5L           EQU  H'0F10'
CCPR5H           EQU  H'0F11'
CCP4CON          EQU  H'0F12'
CCPR4L           EQU  H'0F13'
CCPR4H           EQU  H'0F14'
CCP3CON          EQU  H'0F15'
CCPR3L           EQU  H'0F16'
CCPR3H           EQU  H'0F17'
ECCP3DEL         EQU  H'0F18'
ECCP3AS          EQU  H'0F19'
PSTR3CON         EQU  H'0F1A'
T8CON            EQU  H'0F1B'
PR8              EQU  H'0F1C'
TMR8             EQU  H'0F1D'
T6CON            EQU  H'0F1E'
PR6              EQU  H'0F1F'
TMR6             EQU  H'0F20'
T5GCON           EQU  H'0F21'
T5CON            EQU  H'0F22'
TMR5L            EQU  H'0F23'
TMR5H            EQU  H'0F24'
CM3CON           EQU  H'0F25'
RTCVALL          EQU  H'0F3A'
RTCVALH          EQU  H'0F3B'
PADCFG1          EQU  H'0F3C'
REFOCON          EQU  H'0F3D'
RTCCAL           EQU  H'0F3E'
RTCCFG           EQU  H'0F3F'
ODCON3           EQU  H'0F40'
ODCON2           EQU  H'0F41'
ODCON1           EQU  H'0F42'
ALRMVALL         EQU  H'0F44'
ALRMVALH         EQU  H'0F45'
ALRMRPT          EQU  H'0F46'
ALRMCFG          EQU  H'0F47'
ANCON0           EQU  H'0F48'
ANCON1           EQU  H'0F49'
DSWAKEL          EQU  H'0F4A'
DSWAKEH          EQU  H'0F4B'
DSCONL           EQU  H'0F4C'
DSCONH           EQU  H'0F4D'
DSGPR0           EQU  H'0F4E'
DSGPR1           EQU  H'0F4F'
CCPTMRS2         EQU  H'0F50'
CCPTMRS1         EQU  H'0F51'
CCPTMRS0         EQU  H'0F52'
CVRCON           EQU  H'0F53'
DMABCH           EQU  H'0F66'
DMABCL           EQU  H'0F67'
RXADDRH          EQU  H'0F68'
RXADDRL          EQU  H'0F69'
TXADDRH          EQU  H'0F6A'
TXADDRL          EQU  H'0F6B'
CMSTAT           EQU  H'0F70'
CMSTATUS         EQU  H'0F70'
SSP2CON2         EQU  H'0F71'
SSP2CON1         EQU  H'0F72'
SSP2STAT         EQU  H'0F73'
SSP2ADD          EQU  H'0F74'
SSP2MSK          EQU  H'0F74'
SSP2BUF          EQU  H'0F75'
T4CON            EQU  H'0F76'
PR4              EQU  H'0F77'
TMR4             EQU  H'0F78'
T3CON            EQU  H'0F79'
TMR3             EQU  H'0F7A'
TMR3L            EQU  H'0F7A'
TMR3H            EQU  H'0F7B'
BAUDCON2         EQU  H'0F7C'
SPBRGH2          EQU  H'0F7D'
BAUDCON          EQU  H'0F7E'
BAUDCON1         EQU  H'0F7E'
BAUDCTL          EQU  H'0F7E'
SPBRGH           EQU  H'0F7F'
SPBRGH1          EQU  H'0F7F'
PORTA            EQU  H'0F80'
PORTB            EQU  H'0F81'
PORTC            EQU  H'0F82'
HLVDCON          EQU  H'0F85'
DMACON2          EQU  H'0F86'
OSCCON2          EQU  H'0F87'
DMACON1          EQU  H'0F88'
LATA             EQU  H'0F89'
LATB             EQU  H'0F8A'
LATC             EQU  H'0F8B'
PIE4             EQU  H'0F8E'
PIR4             EQU  H'0F8F'
IPR4             EQU  H'0F90'
PIE5             EQU  H'0F91'
TRISA            EQU  H'0F92'
TRISB            EQU  H'0F93'
TRISC            EQU  H'0F94'
T3GCON           EQU  H'0F97'
PIR5             EQU  H'0F98'
IPR5             EQU  H'0F99'
T1GCON           EQU  H'0F9A'
OSCTUNE          EQU  H'0F9B'
RCSTA2           EQU  H'0F9C'
PIE1             EQU  H'0F9D'
PIR1             EQU  H'0F9E'
IPR1             EQU  H'0F9F'
PIE2             EQU  H'0FA0'
PIR2             EQU  H'0FA1'
IPR2             EQU  H'0FA2'
PIE3             EQU  H'0FA3'
PIR3             EQU  H'0FA4'
IPR3             EQU  H'0FA5'
EECON1           EQU  H'0FA6'
EECON2           EQU  H'0FA7'
TXSTA2           EQU  H'0FA8'
TXREG2           EQU  H'0FA9'
RCREG2           EQU  H'0FAA'
SPBRG2           EQU  H'0FAB'
RCSTA            EQU  H'0FAC'
RCSTA1           EQU  H'0FAC'
TXSTA            EQU  H'0FAD'
TXSTA1           EQU  H'0FAD'
TXREG            EQU  H'0FAE'
TXREG1           EQU  H'0FAE'
RCREG            EQU  H'0FAF'
RCREG1           EQU  H'0FAF'
SPBRG            EQU  H'0FB0'
SPBRG1           EQU  H'0FB0'
CTMUICON         EQU  H'0FB1'
CTMUCONL         EQU  H'0FB2'
CTMUCONH         EQU  H'0FB3'
CCP2CON          EQU  H'0FB4'
ECCP2CON         EQU  H'0FB4'
CCPR2            EQU  H'0FB5'
CCPR2L           EQU  H'0FB5'
CCPR2H           EQU  H'0FB6'
ECCP2DEL         EQU  H'0FB7'
PWM2CON          EQU  H'0FB7'
ECCP2AS          EQU  H'0FB8'
PSTR2CON         EQU  H'0FB9'
CCP1CON          EQU  H'0FBA'
ECCP1CON         EQU  H'0FBA'
CCPR1            EQU  H'0FBB'
CCPR1L           EQU  H'0FBB'
CCPR1H           EQU  H'0FBC'
ECCP1DEL         EQU  H'0FBD'
PWM1CON          EQU  H'0FBD'
ECCP1AS          EQU  H'0FBE'
PSTR1CON         EQU  H'0FBF'
WDTCON           EQU  H'0FC0'
ADCON1           EQU  H'0FC1'
ADCON0           EQU  H'0FC2'
ADRES            EQU  H'0FC3'
ADRESL           EQU  H'0FC3'
ADRESH           EQU  H'0FC4'
SSP1CON2         EQU  H'0FC5'
SSPCON2          EQU  H'0FC5'
SSP1CON1         EQU  H'0FC6'
SSPCON1          EQU  H'0FC6'
SSP1STAT         EQU  H'0FC7'
SSPSTAT          EQU  H'0FC7'
SSP1ADD          EQU  H'0FC8'
SSP1MSK          EQU  H'0FC8'
SSPADD           EQU  H'0FC8'
SSP1BUF          EQU  H'0FC9'
SSPBUF           EQU  H'0FC9'
T2CON            EQU  H'0FCA'
PR2              EQU  H'0FCB'
TMR2             EQU  H'0FCC'
T1CON            EQU  H'0FCD'
TMR1             EQU  H'0FCE'
TMR1L            EQU  H'0FCE'
TMR1H            EQU  H'0FCF'
RCON             EQU  H'0FD0'
CM2CON           EQU  H'0FD1'
CM2CON1          EQU  H'0FD1'
CM1CON           EQU  H'0FD2'
CM1CON1          EQU  H'0FD2'
OSCCON           EQU  H'0FD3'
T0CON            EQU  H'0FD5'
TMR0             EQU  H'0FD6'
TMR0L            EQU  H'0FD6'
TMR0H            EQU  H'0FD7'
STATUS           EQU  H'0FD8'
FSR2L            EQU  H'0FD9'
FSR2H            EQU  H'0FDA'
PLUSW2           EQU  H'0FDB'
PREINC2          EQU  H'0FDC'
POSTDEC2         EQU  H'0FDD'
POSTINC2         EQU  H'0FDE'
INDF2            EQU  H'0FDF'
BSR              EQU  H'0FE0'
FSR1L            EQU  H'0FE1'
FSR1H            EQU  H'0FE2'
PLUSW1           EQU  H'0FE3'
PREINC1          EQU  H'0FE4'
POSTDEC1         EQU  H'0FE5'
POSTINC1         EQU  H'0FE6'
INDF1            EQU  H'0FE7'
WREG             EQU  H'0FE8'
FSR0L            EQU  H'0FE9'
FSR0H            EQU  H'0FEA'
PLUSW0           EQU  H'0FEB'
PREINC0          EQU  H'0FEC'
POSTDEC0         EQU  H'0FED'
POSTINC0         EQU  H'0FEE'
INDF0            EQU  H'0FEF'
INTCON3          EQU  H'0FF0'
INTCON2          EQU  H'0FF1'
INTCON           EQU  H'0FF2'
PROD             EQU  H'0FF3'
PRODL            EQU  H'0FF3'
PRODH            EQU  H'0FF4'
TABLAT           EQU  H'0FF5'
TBLPTR           EQU  H'0FF6'
TBLPTRL          EQU  H'0FF6'
TBLPTRH          EQU  H'0FF7'
TBLPTRU          EQU  H'0FF8'
PC               EQU  H'0FF9'
PCL              EQU  H'0FF9'
PCLATH           EQU  H'0FFA'
PCLATU           EQU  H'0FFB'
STKPTR           EQU  H'0FFC'
TOS              EQU  H'0FFD'
TOSL             EQU  H'0FFD'
TOSH             EQU  H'0FFE'
TOSU             EQU  H'0FFF'

;----- ADCTRIG Bits -----------------------------------------------------
SRC0             EQU  H'0000'
SRC1             EQU  H'0001'

TRIGSEL0         EQU  H'0000'
TRIGSEL1         EQU  H'0001'



